# AXMImporterService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..AXMImporterService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate implementation for AXM import.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId AXMImporterService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AXMImporterService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ AXMImporterService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace